import '../style.css';
import './recipe.css';
import logo from './images/borshch.jpg'


const Recipe = () => {
    return (
        <div className="App">
            <header className="App-header">
                <h1>Рецепт борщу.</h1>
            </header>
            <div className='Ingrideients'>
                <ul >
                    <h1>Інгредієнти</h1>
                    <li><h4>свинина, яловичина</h4><h3>до 1 кг</h3></li>
                    <li><h4>морква</h4><h3>1 шт</h3></li>
                    <li><h4>картопля</h4><h3>2-3 шт</h3></li>
                    <li><h4>квасоля</h4><h3>1 склянка</h3></li>
                    <li><h4>селера і корінь петрушки</h4><h3>за смаком</h3></li>
                    <li><h4>буряк</h4><h3>1-2 шт</h3></li>
                    <li><h4>червоний солодкий перець</h4><h3>1 шт</h3></li>
                    <li><h4>часник</h4><h3>2-3 зубчика</h3></li>
                    <li><h4>цибуля</h4><h3>1 шт</h3></li>
                    <li><h4>білокачанна капуста</h4><h3>0,5 головки</h3></li>
                    <li><h4>паста томатна</h4><h3>2-3 ст. ложки</h3></li>
                    <li><h4>сіль, чорний перець, зелень, лавровий лист, гострий перець, кріп,
                        <br />петрушка, зелень</h4><h3>за смаком</h3></li>
                    <li><h4>сметана</h4><h3>1 ст. ложка</h3></li>

                </ul></div>

            <div className="RecipeText">
                <ul >
                    <p>Як приготувати справжній український борщ — покрокова інструкція:</p>
                    <li>Для початку візьміть каструлю на 5-6 л і залийте холодну воду (трішки понад половину). Поставте на вогонь. Поки вода гріється, добре промийте м'ясо. Наріжте його на достатньо великі шматки. Якщо це ребра, то розділіть по одному і нарубайте на шматки 5-6 см завдовжки. Покладіть у воду, доведіть до кипіння, зніміть пінку, що утворилася</li>
                    <br /><li>Кинути у воду лавровий лист, селеру і корінь петрушки, посолити і поперчити. Міцний бульйон варити приблизно 1 годину. М'ясо повинно легко відділятися від кісток. Коли бульйон буде готовий, витягнути корінь петрушки, селеру і лавровий лист. Додати квасолю, яку попередньо вимочили у воді. Дочекатися кипіння, зменшити вогонь і варити приблизно 20 хвилин. Квасоля повинна бути не повністю готовою.</li>
                    <br /><li>В бульйон додати нарізану кружочками моркву і цибулю. Розчавити часник і також додати. Дрібно нарізати гострий перець. Варити ще 15 хвилин.</li>
                    <br /><li>Почистити буряк. Можна його попередньо злегка підсмажити на салі або вершковому маслі. Можна буряк натерти на тертку чи нарізати невеликою соломкою. Варити 10 хвилин. Після цього додати нарізану кубиками картоплю.</li>
                    <br /><li>Через 15 хвилин картопля вже звариться, тепер настав час додавати томатну пасту, яка додасть борщу кислинку. Нарізати дрібно білокачанну капусту і теж кинути у борщ. Варити ще 5 хвилин.</li>
                    <br /><li>Борщ наприкінці ще раз посоліть, поперчіть, додайте зелені. Вимкніть плиту і дайте настоятися. Що довше, то краще. Подавати зі столовою ложкою сметани. Найкраще — домашньої.</li>
                </ul>
            </div>
            <div className="Ingrideients">
                <img src={logo} alt="" />
            </div>

        </div>
    );
}

export default Recipe;
